app/Http/Controllers/BelumVerifikasiController.php

    public function index()
    {
        $belum_diverifikasi = Pendaftaran::where('status', 'Pending')->orderBy('id', 'desc')->paginate(4); // Ganti 10 dengan jumlah item per halaman yang diinginkan
---
select * from `pendaftaran` where `status` = 'Pending' order by `id` desc limit 4 offset 4
select count(*) as aggregate from `pendaftaran` where `status` = 'Pending'

    public function detail($id)
    {
        $belum_diverifikasi = Pendaftaran::where('id', $id)->first();
---
select * from `pendaftaran` where `id` = '5' limit 1