app/Http/Controllers/NegaraController.php

select * from `negara` order by `id` desc
---
    public function index()
    {
        $negara = Negara::orderBy('id', 'desc')->get();