app/Http/Controllers/RejectVerifikasiController.php

    public function index()
    {
        $reject_diverifikasi = Pendaftaran::where('status', 'Reject')->orderBy('id', 'desc')->paginate(4); // Ganti 10 dengan jumlah item per halaman yang diinginkan
---
select count(*) as aggregate from `pendaftaran` where `status` = 'Reject'

    public function updateStatus(Request $request)
    {
        $pendaftaranId = $request->input('pendaftaran_id');
        $status = $request->input('status');

        // Get the original data before the update
        $reject_diverifikasi = Pendaftaran::findOrFail($pendaftaranId);
        $oldData = $reject_diverifikasi->getOriginal();

        // Update the status in the database
        Pendaftaran::where('id', $pendaftaranId)->update(['status' => $status]);

        // Get the updated data after the update
        $updatedData = Pendaftaran::findOrFail($pendaftaranId)->getOriginal();
---
select * from `pendaftaran` where `pendaftaran`.`id` = '6' limit 1
update `pendaftaran` set `status` = 'Verifikasi', `pendaftaran`.`updated_at` = '2024-02-25 06:07:10' where `id` = '6'