app/Http/Controllers/SudahVerifikasiController.php

    public function index()
    {
        $sudah_diverifikasi = Pendaftaran::where('status', 'Verifikasi')->orderBy('id', 'desc')->paginate(4); // Ganti 10 dengan jumlah item per halaman yang diinginkan
---
select * from `pendaftaran` where `status` = 'Verifikasi' order by `id` desc limit 4 offset 0
select count(*) as aggregate from `pendaftaran` where `status` = 'Verifikasi'